src/clojars-worklog/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-06 Sat 12:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clojars Worklog</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Toby Crawley" />
<link rel="stylesheet" type="text/css" href="worklog-style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Clojars Worklog</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#intro">Intro</a></li>
<li><a href="#dec-2019">December 2019</a></li>
<li><a href="#jan-2020">January 2020</a></li>
<li><a href="#feb-2020">February 2020</a></li>
<li><a href="#mar-2020">March 2020</a></li>
<li><a href="#apr-2020">April 2020</a></li>
<li><a href="#may-2020">May 2020</a></li>
</ul>
</div>
</div>

<div id="outline-container-org77f29e7" class="outline-2">
<h2 id="intro"><a id="org77f29e7"></a>Intro</h2>
<div class="outline-text-2" id="text-intro">
<p>
This worklog covers work performed on <a href="https://clojars.org">Clojars</a> under a limited contract
from <a href="https://www.clojuriststogether.org/">Clojurists Together</a> and the <a href="https://sfconservancy.org/">Software Freedom Conservancy</a>. The
bulk of this work is moving the Clojars infrastructure from Rackspace
to AWS, but also will include security improvements and general
maintenance.
</p>
</div>
</div>

<div id="outline-container-orgc9776e7" class="outline-2">
<h2 id="dec-2019"><a id="orgc9776e7"></a>December 2019</h2>
<div class="outline-text-2" id="text-dec-2019">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-web/compare/8e52280730561a266c4a3830a49a218dd24e816d...5e5b28df3f21b7e4d7c60030715cb17f4fe038bc"><code>clojars-web</code></a>, <a href="https://github.com/clojars/clojars-server-config/compare/6cb7ff40195314278cdcd10cee96948fe31b801f...178476d2fdeaca19920a67f5a510c57da87d59e3"><code>clojars-server-config</code></a> 
</p>

<p>
This month I worked on moving Clojars from an embedded SQLite database
to PostgreSQL. This was the first step in allowing the Clojars server
to be ephemeral, since we can't keep the db on disk to satisfy
that. This included setting up PostgreSQL on the Rackspace server and
setting up hourly/daily backups to Rackspace Cloudfiles along with
adjustments to queries within the app that relied on SQLite quirks. 
</p>
</div>
</div>


<div id="outline-container-org8122878" class="outline-2">
<h2 id="jan-2020"><a id="org8122878"></a>January 2020</h2>
<div class="outline-text-2" id="text-jan-2020">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-web/compare/5e5b28df3f21b7e4d7c60030715cb17f4fe038bc...9ad14ae6cb074a7bd55eca67731ef85b58387d2b"><code>clojars-web</code></a>, <a href="https://github.com/clojars/clojars-server-config/compare/178476d2fdeaca19920a67f5a510c57da87d59e3...9178ddb895800994735d0419bdeb1fcb9afc32cc"><code>clojars-server-config</code></a> 
</p>

<p>
The work in January focused on moving the collected usage statistics
storage from the server to Amazon S3. This required changing all code
that generated and used the stats to use S3 instead. This also
required modifying the Fastly configuration to serve the stats from
S3.
</p>

<p>
I also changed the server Nginx config to redirect all requests made
to the on-server repository to the CDN-backed repository to prepare
for removing the repository from the server.
</p>
</div>
</div>


<div id="outline-container-org63e827a" class="outline-2">
<h2 id="feb-2020"><a id="org63e827a"></a>February 2020</h2>
<div class="outline-text-2" id="text-feb-2020">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-web/compare/9ad14ae6cb074a7bd55eca67731ef85b58387d2b...296cea27b7e3325d775406cd7cfe735bc23ea2dc"><code>clojars-web</code></a>, <a href="https://github.com/clojars/clojars-server-config/compare/9178ddb895800994735d0419bdeb1fcb9afc32cc...4a3a3006367615b109125397c3a7d1caf77e39a8"><code>clojars-server-config</code></a> 
</p>

<p>
This month I moved the repository from Rackspace Cloudfiles to Amazon
S3, and adjusted the Fastly CDN to serve artifacts from S3. This also
involved modifying the feed generation logic to upload to the S3
repository bucket instead of to Cloudfiles.
</p>

<p>
I also set up PostgreSQL on Amazon RDS and modified the Rackspace
server to use that database instead of the local one.
</p>
</div>
</div>


<div id="outline-container-orgefe57f2" class="outline-2">
<h2 id="mar-2020"><a id="orgefe57f2"></a>March 2020</h2>
<div class="outline-text-2" id="text-mar-2020">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-web/compare/296cea27b7e3325d775406cd7cfe735bc23ea2dc...a962a255586bf82f38a009451100f155818ef13a"><code>clojars-web</code></a>, <a href="https://github.com/clojars/clojars-server-config/compare/4a3a3006367615b109125397c3a7d1caf77e39a8...0f69f0eb8a0cd9d9e6e300cbb695c9530b681a0a"><code>clojars-server-config</code></a> 
</p>

<p>
This month I moved the server from Rackspace to AWS EC2. This
involved:
</p>

<ul class="org-ul">
<li>Updating the app to send email via AWS SES</li>
<li>Moving all email receiving (for users and aliases) from the server
to Amazon Workmail</li>
<li>Modifying the Ansible configuration to set up a new server on EC2</li>
<li>Running a <a href="https://groups.google.com/d/msg/clojure/zlBaMkw5Wss/sgGVYQxCAQAJ">beta of the new server setup</a></li>
<li>Switching all traffic to the new server</li>
<li>Removal of all Cloudfiles dependencies from the codebase</li>
</ul>
</div>
</div>

<div id="outline-container-orgd0b565b" class="outline-2">
<h2 id="apr-2020"><a id="orgd0b565b"></a>April 2020</h2>
<div class="outline-text-2" id="text-apr-2020">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-web/compare/a962a255586bf82f38a009451100f155818ef13a...a60d9dc788026651999b63f1e62a1677e637e33d"><code>clojars-web</code></a>, <a href="https://github.com/clojars/clojars-server-config/compare/0f69f0eb8a0cd9d9e6e300cbb695c9530b681a0a...683e8ea9b51b24a2dc31f13ce742587ce2461ba1"><code>clojars-server-config</code></a> 
</p>

<p>
This month included work finishing up the migration to AWS, including:
</p>

<ul class="org-ul">
<li>Setting up a way to build new AMIs for the server</li>
<li>Modifying the deploy process to allow new instances to deploy the
current release</li>
<li>Moving the server to an auto-scaling group to make it more robust
and allow zero-downtime new AMI releasing</li>
<li><a href="https://github.com/clojars/clojars-server-config#system-diagram">Documenting the new server architecture</a></li>
<li>Upgrading from Java 8 to Java 11</li>
</ul>

<p>
I then started on improving security. The work here was focused on
adding a <a href="https://github.com/clojars/clojars-web/issues/726">deploy token</a> feature. This was <a href="https://groups.google.com/forum/#!topic/clojars-maintainers/nqV5yc-05BI">released in early May</a>, but 90%
of the work was completed in April.
</p>

<p>
I also <a href="https://github.com/clojars/clojars-web/issues/495">fixed an issue</a> where the cookies weren't being set as secure.
</p>
</div>
</div>

<div id="outline-container-orgfff5c9e" class="outline-2">
<h2 id="may-2020"><a id="orgfff5c9e"></a>May 2020</h2>
<div class="outline-text-2" id="text-may-2020">
<p>
<b>Changelogs:</b> <a href="https://github.com/clojars/clojars-web/compare/a60d9dc788026651999b63f1e62a1677e637e33d...1923aec0b0c7e49ffc3ca3eea79f1989e78e17d3"><code>clojars-web</code></a>, <a href="https://github.com/clojars/clojars-server-config/compare/683e8ea9b51b24a2dc31f13ce742587ce2461ba1...f49d515bdc63d94aa114b2a97c282f1af3bc6025"><code>clojars-server-config</code></a>
</p>

<p>
I continued working on deploy tokens, adding:
</p>
<ul class="org-ul">
<li><a href="https://github.com/clojars/clojars-web/commit/f6fc33168c76298bd084e8903ec9bf22a9ec226e">An endpoint</a> that GitHub will use to report when a deploy token is
found in source code that will notify the user and disable the token</li>
<li>The option to <a href="https://github.com/clojars/clojars-web/commit/fc572b5cf1acdbaf17655b1b8a6f32bfcc89015e">scope a deploy token to a group or artifact</a></li>
</ul>

<p>
I also <a href="https://github.com/clojars/clojars-web/pull/758">implemented the bulk of two-factor authentication</a>. This wasn't
released in May, but will be released by mid-June.
</p>

<p>
Part of the two-factor implementation is <a href="https://github.com/clojars/clojars-web/pull/758/commits/62e5e2313bd47530b44de732c7a2844ffe1783ee">an internal eventing system</a>
that will make it easier to add additional email notifications in the
future.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Crawley</p>
<p class="date">Created: 2020-06-06 Sat 12:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
